import pandas as pd
import pytest


@pytest.fixture
def sample_transactions():
    return pd.DataFrame(
        {
            "Дата операции": [
                "20.01.2023 12:00:00",
                "20.02.2023 12:00:00",
                "20.03.2023 12:00:00",
                "20.04.2023 12:00:00",
                "29.09.1997 12:00:00",
            ],
            "Категория": ["Еда", "Еда", "Еда", "Транспорт", "Медицинские услуги"],
            "Кэшбэк": [0, 4, 50, None, None],
        }
    )


@pytest.fixture
def setup_mocks(mocker):
    """Автоматически подменяет все внешние зависимости для каждого теста"""
    # Мок для json.load с пустым словарём по умолчанию
    mocker.patch("src.decorators.json.load", return_value={})

    # Мок для json.dump
    mocker.patch("src.decorators.json.dump")

    # Мок для open и Path.touch
    mocker.patch("src.decorators.Path.touch")

    # Мок для hashlib.sha256 (чтобы тесты были детерминированы)
    mock_sha256 = mocker.patch("src.decorators.hashlib.sha256")
    mock_sha256.return_value.hexdigest.return_value = "mocked_hash"


@pytest.fixture
def more_complex_transactions():
    return [
        {
            "Дата операции": "10.01.2020 12:00:00",
            "Статус": "OK",
            "Номер карты": "*4556",
            "Сумма операции с округлением": 100.0,
            "Кэшбэк": 1.0,
            "Категория": "Еда",
            "Описание": "Магазин",
            "Дата платежа": "10.01.2020",
        },
        {
            "Дата операции": "09.01.2020 15:30:00",
            "Статус": "OK",
            "Номер карты": "*7197",
            "Сумма операции с округлением": 200.0,
            "Кэшбэк": 0.0,
            "Категория": "Транспорт",
            "Описание": "Такси",
            "Дата платежа": "09.01.2020",
        },
        {
            "Дата операции": "11.01.2020 10:00:00",
            "Статус": "OK",
            "Номер карты": "*4556",
            "Сумма операции с округлением": 300.0,
            "Кэшбэк": 3.0,
            "Категория": "Развлечения",
            "Описание": "Кино",
            "Дата платежа": "11.01.2020",
        },
        {
            "Дата операции": "08.01.2020 18:00:00",
            "Статус": "FAILED",
            "Номер карты": "*4556",
            "Сумма операции с округлением": 400.0,
            "Кэшбэк": 4.0,
            "Категория": "Одежда",
            "Описание": "Магазин",
            "Дата платежа": "08.01.2020",
        },
    ]
